#!/usr/bin/python2
# -*- coding: utf-8 -*-

# Φτιάξτε την συνάρτηση solution έτσι ώστε:
#
#Να δέχεται μία παράμετρο, η οποία θα είναι το όνομα ενός αρχείου.
#Το αρχείο αυτό θα περιέχει γραμμές με διάφορες τυχαίες λέξεις.
#(οι λέξεις διαχωρίζονται μεταξύ τους με ένα ακριβώς κενό)
#Δεν υπάρχουν προτάσεις. Μόνο λέξεις.
#Μπορείτε να δείτε ένα παράδειγμα αρχείου στο sample.txt με 
#την εντολή:
#cat sample.txt
#
#Η συνάρτησή solution θα πρέπει 
#να διαβάζει με την σειρά όλες τις λέξεις του αρχείου
#και να τις βάζει σε μία λίστα
#την οποία θα επιστρέφει.
#
#
#BONUS 1: Να επιτρέπεται οι λέξεις να χωρίζονται με περισσότερο από ένα κενά.
#BONUS 2: Η λίστα να είναι ταξινομημένη σε αύξουσα σειρά
#
#      

def solution():
    print "solution starts here" # μπορείτε να την σβήσετε αυτή την γραμμή
    

