#!/usr/bin/python2
# -*- coding: utf-8 -*-

# Φτιάξτε την συνάρτηση solution έτσι ώστε:
#
# 1) Να παίρνει δύο παραμέτρους :
#    - η πρώτη παράμετρος θα είναι μία λίστα ταξινομημένη ήδη σε αύξουσα σειρά
#    - η δεύτερη παράμετρος θα είναι μία αριθμητική τιμή
# 2) Η συνάρτηση solution θα πρέπει να επιστρέφει:
#    - Την θέση (ξεκινώντας από 0) στην οποία βρίσκεται η αριθμητική 
#    τιμή μέσα στην λίστα.
#    - -1 (μείον ένα) αν η τιμή δεν υπάρχει μέσα στην λίστα
# 3) Η συνάρτηση θα πρέπει να χρησιμοποιεί τον αλγόριθμο της δυαδικής αναζήτησης
#      

def solution():
    print "solution starts here" # μπορείτε να την σβήσετε αυτή την γραμμή
    

