#!/usr/bin/python2
# -*- coding: utf-8 -*-

#
#Πριν ξεκινήσετε την λύση αυτής της άσκησης,
#δείτε το περιεχόμενου του αρχείου chessboard.txt
#με την εντολή cat:
#
    #cat chessboard.txt
#
#Το chessboard.txt περιέχει μία απλή σκακιέρα,
#με 8 γραμμές και 8 στήλες 
#που όμως όλα τα τετράγωνά της είναι λευκά.
#
#Η συνάρτηση solution θα πρέπει να "ζωγραφίζει"
#τα μαύρα τετράγωνα της σκακιέρας,
#βάζοντας ένα X στα σωστά τετράγωνα.
#
#Το πάνω αριστερά τετράγωνο θα πρέπει να είναι άσπρο,
#και κατόπιν το επόμενο μαύρο
#και μετά πάλι άσπρο, εναλλάξ.
#
#_________________
#| |X| |X| |X| |X|
#|X| |X| |X|...
#
#Επομένως, 
#
#η συνάρτηση solution() θα πρέπει:
    #1) Να ανοίγει σωστά το αρχείο chessboard.txt
    #2) Να τροποποιεί το περιεχόμενό του κατάλληλα με βάση τις παραπάνω οδηγίες
#
#Οπως πάντα, η ./check.py θα ελέγξει αν η λύση σας είναι σωστή.
#
#Σημείωση:
    #Αν στις δοκιμές σας, καταστραφεί το αρχείο chessboard.txt,
    #μπορείτε να το επαναφέρετε αντιγράφοντας το chessboard.original.txt:
        #cp chessboard.original.txt chessboard.txt
#
#
#
#      

def solution():
    print "solution starts here" # μπορείτε να την σβήσετε αυτή την γραμμή
    

