#!/usr/bin/python2
# -*- coding: utf-8 -*-

# Φτιάξτε την συνάρτηση solution έτσι ώστε:
#
# Η παρακάτω συνάρτηση δημιουργεί και επιστρέφει μία λίστα με αριθμούς.
# Το όνομα αυτής της λίστας είναι LISTA
# Βάλτε στην range τα σωστά ορίσματα ώστε η LISTA να περιέχει:
# 1) Πρώτα όλα τους ζυγούς αριθμούς από το 100 έως και το 50
# 2) Κατόπιν τους μονούς αριθμούς από 49 μέχρι και το 11
# 3) Τέλος τους αριθμούς 10 έως και 1

def solution():
    LISTA = [] #Εδώ δημιουργούμε μία κενή λίστα

    # Η for για το πρώτο ερώτημα. Δώστε τα σωστά ορίσματα στην range:
    for i in range(100,49,-2):
        LISTA.append(i)

    # Η for για το δεύτερο ερώτημα. Δώστε τα σωστά ορίσματα στην range:
    for i in range(49,10,-2):
        LISTA.append(i)

    # Η for για το τρίτο ερώτημα. Δώστε τα σωστά ορίσματα στην range:
    for i in range(10,0,-1):
        LISTA.append(i)

    return LISTA

    

