#!/usr/bin/python2
# -*- coding: utf-8 -*-

# Φτιάξτε την συνάρτηση solution έτσι ώστε:
#
#Να δέχεται μία παράμετρο, η οποία θα είναι το όνομα ενός αρχείου.
#
# Το πρόγραμμά σας θα πρέπει :
#
#1) να μετράει και να επιστρέφει πόσα μικρά αγγλικά φωνήεντα 
#   υπάρχουν στο αρχείο.
#   Τα μικρά αγγλικά φωνήεντα είναι τα γράμματα : (a,e,i,o,u,y)
#2) να αντικαθηστά όλα τα φωνήεντα με κεφαλαίο αγγλικό X
#
#      

def solution():
    print "solution starts here" # μπορείτε να την σβήσετε αυτή την γραμμή
    

