#!/usr/bin/python2
# -*- coding: utf-8 -*-

# Φτιάξτε την συνάρτηση solution έτσι ώστε:
#
#Να δέχεται μία παράμετρο, η οποία θα είναι το όνομα ενός αρχείου.
#Το αρχείο θα περιέχει πολλές γραμμές με τα γράμματα O και ένα μοναδικό o.
#Ενα παράδειγμα τέτοιου αρχείου είναι τα sample.txt.
#Μπορείτε να το δείτε με :
    #cat sample.txt
#Το πρόγραμμά σας θα πρέπει :
#1) να εντοπίζει το μοναδικό γράμμα o,
#2) να επιστρέφει την θέση μέσα στο αρχείο που βρίσκεται το o
#3) να ο αντικαθιστά το o με X.
#      

def solution():
    print "solution starts here" # μπορείτε να την σβήσετε αυτή την γραμμή
    

