#!/usr/bin/python2
# -*- coding: utf-8 -*-

# Φτιάξτε την συνάρτηση solution έτσι ώστε:
#
# Η παρακάτω συνάρτηση δημιουργεί και επιστρέφει μία λίστα με αριθμούς.
# Το όνομα αυτής της λίστας είναι LISTA
# Βάλτε στην while την κατάληλλη συνθηκη ώστε να τερματίζει όταν το x γίνει μεγαλύτερο το z

def solution():
    LISTA = [] #Εδώ δημιουργούμε μία κενή λίστα

    x = 0
    z = 1000
    while : #Προσθέστε εδώ την σωστή συνθήκη.
        LISTA.append( (x,z) ) 
        x+=1
        z-=1

    return LISTA


    

