#!/usr/bin/python2
# -*- coding: utf-8 -*-

# Φτιάξτε την συνάρτηση solution έτσι ώστε:
#
# 1) Να δημιουργεί ένα αρχείο με το όνομα numbers.txt
# 2) Να γράφει μέσα στο αρχείο τις παρακάτω τρεις γραμμές
# one
# two
# three
# 3) Να προσθέτει σ' ένα αρχείο με το όνομα days.txt:
# Μία γραμμή με το όνομα μίας μέρας από:
# Mon, Tue, Wed, Thu, Fri, Sat, Sun
# Το όνομα της μέρας που θα προσθετει, θα το καθορίζει μία αριθμητική
# παράμετρος η οποία θα ξεκινάει από το 1 (Mon) και θα μπορεί να φτάσει
# μέχρι το 7 (Sun).
# Για παράδειγμα το solution(2) θα προσθέτει την Tue
# 4) Να επιστρέφει το πλήθος των γραμμών του αρχείου days.txt
#      

def solution():
    print "solution starts here" # μπορείτε να την σβήσετε αυτή την γραμμή
    

