#!/usr/bin/python2
# -*- coding: utf-8 -*-

# Φτιάξτε την συνάρτηση solution έτσι ώστε:
#
# Η παρακάτω συνάρτηση δημιουργεί και επιστρέφει μία λίστα με αριθμούς.
# Το όνομα αυτής της λίστας είναι LISTA
# Βάλτε στην range τα σωστά ορίσματα ώστε η LISTA να περιέχει:
# 1) Πρώτα όλα τους αριθμούς από το 0 έως και το 5,
# 2) Κατόπιν τους ζυγούς αριθμούς από 6 έως και 32.
# 3) Τέλος τους μονούς αριθμούς από το 33 μέχρι και το 43

def solution():
    LISTA = [] #Εδώ δημιουργούμε μία κενή λίστα

    # Η for για το πρώτο ερώτημα. Δώστε τα σωστά ορίσματα στην range:
    for i in range():
        LISTA.append(i)

    # Η for για το δεύτερο ερώτημα. Δώστε τα σωστά ορίσματα στην range:
    for i in range():
        LISTA.append(i)

    # Η for για το τρίτο ερώτημα. Δώστε τα σωστά ορίσματα στην range:
    for i in range():
        LISTA.append(i)


    

